-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Dec 12, 2021 at 10:41 PM
-- Server version: 10.4.22-MariaDB
-- PHP Version: 7.3.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `newline`
--

-- --------------------------------------------------------

--
-- Table structure for table `alertsystem`
--

CREATE TABLE `alertsystem` (
  `id` int(11) NOT NULL,
  `text1` text NOT NULL,
  `text2` text NOT NULL,
  `colorchange` varchar(255) NOT NULL,
  `color2` varchar(255) NOT NULL,
  `checkshare` int(11) NOT NULL DEFAULT 1,
  `stext1` int(11) NOT NULL DEFAULT 1,
  `stext2` int(11) NOT NULL DEFAULT 1,
  `sshares` int(11) NOT NULL DEFAULT 1,
  `allshow` int(11) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `alertsystem`
--

INSERT INTO `alertsystem` (`id`, `text1`, `text2`, `colorchange`, `color2`, `checkshare`, `stext1`, `stext2`, `sshares`, `allshow`) VALUES
(2, 'صلي علي نبيك ونبي جميع الخلائق سيدنا محمد عليه افضل الصلاة واتم التسليم', 'وروى مسلم في صحيحه من حديث أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم قال: «من دعا إلى هدى كان له من الأجر مثل أجور من تبعه، لا ينقص ذلك من أجورهم شيئًا', '#370101', '#208843', 1, 1, 1, 1, 1),
(3, 'اللهم صل وسلم على سيدنا محمد صلاة تحل بها عقدتي', '«مَا يُصِيبُ المُسْلِمَ مِنْ نَصَبٍ، وَلاَ وَصَبٍ، وَلاَ هَمِّ، وَلاَ حُزْنٍ، وَلاَ أَذًى، وَلاَ غَمِّ، حَتَّى الشَّوْكَةِ يُشَاكُهَا؛ إِلاَّ كَفَّرَ الله بِهَا مِنْ خَطَايَاهُ» (متفق عليه).', '#2a4b98', '#d72d58', 1, 1, 1, 1, 1),
(4, 'صلي علي نبيك ونبي جميع الخلائق سيدنا محمد عليه افضل الصلاة واتم التسليم', 'إنَّ المسلمَ يُصلِّي وخطاياه مرفوعةٌ على رأسِه، كلما سجد تحاتَّتْ عنه، فيفرغُ من صلاتِه؛ وقد تحاتَّتْ خطاياه» (السلسلة الصحيحة؛ برقم: [3402]).', '#000000', '#e02401', 1, 1, 1, 1, 1),
(5, 'صلي علي نبيك ونبي جميع الخلائق سيدنا محمد عليه افضل الصلاة واتم التسليم', 'ما جلس قوم يذكرون الله عز وجل إلا ناداهم مناد من السماء: قوموا مغفورًا لكم قد بُدِّلت سيئاتكم حسنات» (السلسلة الصحيحة؛ برقم: [2210]).', '#77D970 ', '#297F87', 1, 1, 1, 1, 1),
(6, 'صلي علي نبيك ونبي جميع الخلائق سيدنا محمد عليه افضل الصلاة واتم التسليم', 'قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: (يقولُ اللَّهُ: إذا أرادَ عَبْدِي أنْ يَعْمَلَ سَيِّئَةً، فلا تَكْتُبُوها عليه حتَّى يَعْمَلَها، فإنْ عَمِلَها فاكْتُبُوها بمِثْلِها، وإنْ تَرَكَها مِن أجْلِي فاكْتُبُوها له حَسَنَةً، وإذا أرادَ أنْ يَعْمَلَ حَسَنَ,', '#BB371A ', '#4AA96C', 1, 1, 1, 1, 1),
(7, 'صلي علي نبيك ونبي جميع الخلائق سيدنا محمد عليه افضل الصلاة واتم التسليم', 'قال رسول الله صلى الله عليه وسلم:(قالَ اللَّهُ تبارَكَ وتعالى يا ابنَ آدمَ إنَّكَ ما دعوتَني ورجوتَني غفَرتُ لَكَ على ما كانَ فيكَ ولا أبالي، يا ابنَ آدمَ لو بلغت ذنوبُكَ عَنانَ السَّماءِ ثمَّ استغفرتَني غفرتُ لَكَ، ولا أبالي، يا ابنَ آدمَ إنَّكَ لو أتيتَ', '#292C6D ', '#EC255A', 1, 1, 1, 1, 1),
(8, 'صلي علي نبيك ونبي جميع الخلائق سيدنا محمد عليه افضل الصلاة واتم التسليم', 'روى مسلم عن عبدالله بن عمرو بن العاص رضي الله عنهما، قال: سمعت رسول الله صلى الله عليه وسلم يقول: ((كتب الله مقادير الخلائق قبل أن يخلق السماوات والأرض بخمسين ألف سنةٍ، قال: وعرشه على الماء))', '#222831 ', '#949CDF', 1, 1, 1, 1, 1),
(9, 'صلي علي نبيك ونبي جميع الخلائق سيدنا محمد عليه افضل الصلاة واتم التسليم', 'وَاللَّهُ يُرِيدُ أَنْ يَتُوبَ عَلَيْكُمْ وَيُرِيدُ الَّذِينَ يَتَّبِعُونَ الشَّهَوَاتِ أَنْ تَمِيلُوا مَيْلًا عَظِيمًا ﴾ [النساء: 27] ', '#F78812 ', '#E02401', 1, 1, 1, 1, 1),
(10, 'صلي علي نبيك ونبي جميع الخلائق سيدنا محمد عليه افضل الصلاة واتم التسليم', 'الَّذِينَ يَحْمِلُونَ الْعَرْشَ وَمَنْ حَوْلَهُ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وَيُؤْمِنُونَ بِهِ وَيَسْتَغْفِرُونَ لِلَّذِينَ آمَنُوا رَبَّنَا وَسِعْتَ كُلَّ شَيْءٍ رَحْمَةً وَعِلْمًا فَاغْفِرْ لِلَّذِينَ تَابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذَابَ ', '#8E2657 ', '#171717', 1, 1, 1, 1, 1),
(11, 'صلي علي نبيك ونبي جميع الخلائق سيدنا محمد عليه افضل الصلاة واتم التسليم', 'وَهُوَ الَّذِي يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهِ وَيَعْفُو عَنِ السَّيِّئَاتِ وَيَعْلَمُ مَا تَفْعَلُونَ ﴾ [الشورى: 25]', '#3E00FF ', '#170055', 1, 1, 1, 1, 1),
(12, 'صلي علي نبيك ونبي جميع الخلائق سيدنا محمد عليه افضل الصلاة واتم التسليم', 'قال تعالى في سورة الأعراف، الآية 156: (( قَالَ عَذَابِي أُصِيبُ بِهِ مَن أَشَاء وَرَحمَتِي وَسِعَت كُلَّ شَيءٍ فَسَأَكتُبُهَا لِلَّذِينَ يَتَّقُونَ وَيُؤتُونَ الزَّكَـاةَ وَالَّذِينَ هُم بِآيَاتِنَا يُؤمِنُونَ ))', '#B85252 ', '#2C272E', 1, 1, 1, 1, 1),
(13, 'صلي علي نبيك ونبي جميع الخلائق سيدنا محمد عليه افضل الصلاة واتم التسليم', '( وَضَاقَتْ عَلَيْكُمُ الأَرْضُ بِمَا رَحُبَتْ ثُمَّ وَلَّيْتُم مُّدْبِرِينَ* ثُمَّ أَنَزلَ اللّهُ سَكِينَتَهُ عَلَى رَسُولِهِ وَعَلَى الْمُؤْمِنِينَ وَأَنزَلَ جُنُوداً لَّمْ تَرَوْهَا وَعذَّبَ الَّذِينَ كَفَرُواْ وَذَلِكَ جَزَاء الْكَافِرِينَ ) {التوبة :', '#8E2657 ', '#171717', 1, 1, 1, 1, 1),
(14, 'صلي علي نبيك ونبي جميع الخلائق سيدنا محمد عليه افضل الصلاة واتم التسليم', 'أَفَلا يَتَدَبَّرُونَ الْقُرْآنَ وَلَوْ كَانَ مِنْ عِنْدِ غَيْرِ اللَّهِ لَوَجَدُوا فِيهِ اخْتِلافًا كَثِيرًا (82)', '#BB371A ', '#4AA96C', 1, 1, 1, 1, 1),
(15, 'صلي علي نبيك ونبي جميع الخلائق سيدنا محمد عليه افضل الصلاة واتم التسليم', 'قال تعالى: (أَوَلَا يَذْكُرُ الْإِنسَانُ أَنَّا خَلَقْنَاهُ مِن قَبْلُ وَلَمْ يَكُ شَيْئًا) (مريم :67)', '#000000', '#98b6b9', 1, 1, 1, 1, 1),
(17, 'صلي علي نبيك ونبي جميع الخلائق سيدنا محمد عليه افضل الصلاة واتم التسليم', '(وَلَقَدْ صَرَّفْنَا فِي هَذَا الْقُرْآنِ لِلنَّاسِ مِن كُلِّ مَثَلٍ وَكَانَ الْإِنسَانُ أَكْثَررَ شَيْءٍ جَدَلًا) (الكهف : 54)', '#8E2657 ', '#171717', 1, 1, 1, 1, 1),
(50, 'اللهم صل وسلم على سيدنا محمد صلاة تحل بها عقدتي', '«مَا يُصِيبُ المُسْلِمَ مِنْ نَصَبٍ، وَلاَ وَصَبٍ، وَلاَ هَمِّ، وَلاَ حُزْنٍ، وَلاَ أَذًى، وَلاَ غَمِّ، حَتَّى الشَّوْكَةِ يُشَاكُهَا؛ إِلاَّ كَفَّرَ الله بِهَا مِنْ خَطَايَاهُ» (متفق عليه).', '#595B83', '#344CB7', 0, 1, 1, 1, 1),
(51, 'صلي علي نبيك ونبي جميع الخلائق سيدنا محمد عليه افضل الصلاة واتم التسليم', 'قال رسول الله صلى الله عليه وسلم:(قالَ اللَّهُ تبارَكَ وتعالى يا ابنَ آدمَ إنَّكَ ما دعوتَني ورجوتَني غفَرتُ لَكَ على ما كانَ فيكَ ولا أبالي، يا ابنَ آدمَ لو بلغت ذنوبُكَ عَنانَ السَّماءِ ثمَّ استغفرتَني غفرتُ لَكَ، ولا أبالي، يا ابنَ آدمَ إنَّكَ لو أتيتَ', '#595B83', '#344CB7', 0, 1, 1, 1, 1),
(52, 'صلي علي نبيك ونبي جميع الخلائق سيدنا محمد عليه افضل الصلاة واتم التسليم', 'روى مسلم عن عبدالله بن عمرو بن العاص رضي الله عنهما، قال: سمعت رسول الله صلى الله عليه وسلم يقول: ((كتب الله مقادير الخلائق قبل أن يخلق السماوات والأرض بخمسين ألف سنةٍ، قال: وعرشه على الماء))', '#595B83', '#344CB7', 0, 1, 1, 1, 1);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `alertsystem`
--
ALTER TABLE `alertsystem`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `alertsystem`
--
ALTER TABLE `alertsystem`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=53;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
